{
  "Momen Refaat": "مؤمن رفعت",
  "projects": "المشاريع",
  "About": "عني",
  "Connect us": "تواصل معنا",
  "Hi, I'm Momen Refaat": "أهلاً انا مؤمن رفعت",
  "Front-End Developer": "مطور واجهة أمامية",
  "A cairo based front-end developer passionate about building accessible and user friendly websites.": "مطور واجهة أمامية مقيم في القاهرة مهتم ببناء مواقع ويب سهلة الوصول وسهلة الاستخدام.",
  "CONTACT ME": "اتصل بي",
  "Featured Projects": "المشاريع المميزة",
  "Here are some of the selected projects that showcase my passion for front-end development.": "فيما يلي بعض المشاريع المختارة التي تعكس شغفي بتطوير الواجهة الأمامية.",
  "Bootstrap Practice Project": "Bootstrap مشروع ممارسة",
  "This website was developed as a practice project to enhance my front-end skills after learning Bootstrap. I focused on implementing Bootstrap’s grid system, responsive design techniques, and UI components to create a user-friendly and modern layout.": "طُوِّر هذا الموقع الإلكتروني كمشروع تدريبي لتعزيز مهاراتي في تصميم واجهة المستخدم بعد تعلمي لـ Bootstrap. ركّزتُ على تطبيق نظام الشبكة في Bootstrap، وتقنيات التصميم المتجاوب، ومكونات واجهة المستخدم لإنشاء تصميم عصري وسهل الاستخدام.",
  "Project Info": "معلومات المشروع",
  "Year": "سنة",
  "Role": "دور",
  "Front-end Developer": "مطور واجهة أمامية",
  "LIVE DEMO": "العرض التوضيحي المباشر",
  "See on Github": " Github انظر على ",
  "Currency Converter – Real-Time Exchange Rates": "محول العملات - أسعار الصرف في الوقت الفعلي",
  "This Currency Converter web app is designed to make currency conversion simple and fast. Users can select from a wide range of global currencies, such as USD, EUR, GBP, EGP, and more, and instantly see the conversion result. The project demonstrates my skills in JavaScript for dynamic calculations and creating user-friendly, responsive web interfaces.": "صُمم تطبيق الويب محوّل العملات هذا لتسهيل عملية تحويل العملات وسرعتها. يتيح التطبيق للمستخدمين الاختيار من بين مجموعة واسعة من العملات العالمية، مثل الدولار الأمريكي واليورو والجنيه الإسترليني والجنيه المصري وغيرها، ورؤية نتيجة التحويل فورًا. يُظهر هذا المشروع مهاراتي في جافا سكريبت لإجراء حسابات ديناميكية وإنشاء واجهات ويب سهلة الاستخدام وسريعة الاستجابة.",
  "Photo Sharing & Social Interaction Platform": "منصة مشاركة الصور والتفاعل الاجتماعي",
  "This project is a photo-sharing platform where users can create accounts, upload photos, and engage with others by leaving comments on posts. Each user has a personal profile, with the ability to edit or delete their own posts and publish new ones. The project demonstrates core functionalities of modern social media platforms, including user authentication, content management, and interactive features.": "هذا المشروع عبارة عن منصة لمشاركة الصور، حيث يُمكن للمستخدمين إنشاء حسابات، وتحميل الصور، والتفاعل مع الآخرين من خلال ترك تعليقات على المنشورات. يمتلك كل مستخدم ملفًا شخصيًا، مع إمكانية تعديل أو حذف منشوراته، ونشر منشورات جديدة. يُوضح المشروع الوظائف الأساسية لمنصات التواصل الاجتماعي الحديثة، بما في ذلك مصادقة المستخدم، وإدارة المحتوى، والميزات التفاعلية.",
  "SEO Landing Page – HTML & CSS Project": "صفحة هبوط مُحسّنة لمحركات البحث - مشروع HTML وCSS",
  "This project is a professional SEO-focused landing page developed using only HTML and CSS. It highlights key aspects of Search Engine Optimization with a clean, user-friendly layout and modern design. The page is responsive and structured to demonstrate best practices in web design while providing an engaging presentation of SEO services.": "هذا المشروع عبارة عن صفحة هبوط احترافية مُركزة على تحسين محركات البحث (SEO)، مُطورة باستخدام HTML وCSS فقط. تُسلط الصفحة الضوء على الجوانب الرئيسية لتحسين محركات البحث بتصميم أنيق وسهل الاستخدام وعصري. تتميز الصفحة بسرعة الاستجابة وهيكليتها، مما يُظهر أفضل الممارسات في تصميم المواقع الإلكترونية، مع تقديم عرض جذاب لخدمات تحسين محركات البحث.",
  "React To-Do List App – Task Manager": "تطبيق React To-Do List – مدير المهام",
  "This project is a To-Do List application developed using React.js, focusing on efficient task management. The app allows users to add new tasks, edit them, mark tasks as completed or incomplete, and remove tasks as needed. It demonstrates React’s powerful state management and component-based architecture, with a user-friendly and responsive design.": "هذا المشروع عبارة عن تطبيق قائمة مهام مُطوّر باستخدام React.js، مع التركيز على إدارة المهام بكفاءة. يتيح التطبيق للمستخدمين إضافة مهام جديدة، وتعديلها، وتحديد المهام كمكتملة أو غير مكتملة، وحذفها عند الحاجة. يُظهر التطبيق كفاءة إدارة الحالات وهندسة المكونات في React، بتصميم سهل الاستخدام وسريع الاستجابة.",
  "Cairo Weather App – Dynamic API & Multi-Language Support": "تطبيق طقس القاهرة - واجهة برمجة تطبيقات ديناميكية ودعم متعدد اللغات",
  "This weather application provides real-time temperature data for Cairo using a weather API. It features a dynamic interface with the ability to switch between languages, offering a smooth and user-friendly experience.": "يوفر تطبيق الطقس هذا بيانات فورية لدرجات الحرارة في القاهرة باستخدام واجهة برمجة تطبيقات خاصة بالطقس. يتميز بواجهة ديناميكية مع إمكانية التبديل بين اللغات، مما يوفر تجربة سلسة وسهلة الاستخدام.",
  "Prayer Times App – Dynamic API for Egyptian Cities": "تطبيق مواقيت الصلاة - واجهة برمجة تطبيقات ديناميكية للمدن المصرية",
  "This project is a web application that displays prayer times for various governorates in Egypt. It dynamically fetches accurate timings using an API, providing users with up-to-date and reliable prayer schedules.": "هذا المشروع عبارة عن تطبيق ويب يعرض مواقيت الصلاة لمختلف محافظات مصر. يقوم التطبيق بجلب التوقيتات الدقيقة ديناميكيًا باستخدام واجهة برمجة التطبيقات (API)، مما يوفر للمستخدمين جداول صلاة محدثة وموثوقة.",
  "About Me": "ْعَنِّي",
  "I’m a passionate front-end developer based in Badr City, I continuously strive to improve my skills in web development and create engaging user experiences.": "أنا مطور واجهة أمامية متحمس ومقيم في مدينة بدر، وأسعى باستمرار إلى تحسين مهاراتي في تطوير الويب وإنشاء تجارب مستخدم جذابة.",
  "Web Developer, Front End, Motivated junior front-end developer based in Egypt, with a solid understanding of HTML, CSS, and JavaScript. Recently started working with frameworks like React.js and focused on building clean, responsive, and user-friendly interfaces. Passionate about learning new web technologies and improving my skills continuously. Eager to contribute to creative teams and help build high-quality digital products with great user experience.": "مطور ويب، واجهة أمامية، مبتدئ متحمس، مقيم في مصر، يتمتع بفهم معمق لـ HTML وCSS وJavaScript. بدأتُ مؤخرًا العمل مع أطر عمل مثل React.js، وركزتُ على بناء واجهات مستخدم أنيقة وسريعة الاستجابة وسهلة الاستخدام. شغوف بتعلم تقنيات الويب الجديدة وتطوير مهاراتي باستمرار. أتطلع إلى المساهمة في فرق إبداعية والمساعدة في بناء منتجات رقمية عالية الجودة توفر تجربة مستخدم رائعة.",
  "Skils": "المهارات",
  "Let’s connect": "دعونا نتواصل",
  "Say Hello At": "قل مرحباً ل",
  "Email Address": "عنوان البريد الإلكتروني",
  "Message": "رسالة",
  "English": "العربية"
  

  
}